:PROPERTIES:
:ID:       bdd3bf17-ccce-488a-96e9-031694daa04e
:END:
#+title: Programming - TypeScript
* Root
[[id:660c7092-9b98-4fa2-b271-2bbeabe1c249][Programming]]

* TypeScript
** References
Excellent tutorial about Typescript
[[https://www.digitalocean.com/community/tutorials/how-to-use-basic-types-in-typescript][How To Use Basic Types in TypeScript | DigitalOcean]]

** Enums
#+begin_src typescript
enum CardinalDirection {
  North = 1,
  East,
  South,
  West,
};

console.log(CardinalDirection.North)
console.log(CardinalDirection[1])
#+end_src

#+RESULTS:
: 1
: North
